# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Thu Jun 25 12:32:08 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design spi_top

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_load -pin_load 0.15 [get_ports {master_rx[7]}]
set_load -pin_load 0.15 [get_ports {master_rx[6]}]
set_load -pin_load 0.15 [get_ports {master_rx[5]}]
set_load -pin_load 0.15 [get_ports {master_rx[4]}]
set_load -pin_load 0.15 [get_ports {master_rx[3]}]
set_load -pin_load 0.15 [get_ports {master_rx[2]}]
set_load -pin_load 0.15 [get_ports {master_rx[1]}]
set_load -pin_load 0.15 [get_ports {master_rx[0]}]
set_load -pin_load 0.15 [get_ports master_done]
set_load -pin_load 0.15 [get_ports master_busy]
set_load -pin_load 0.15 [get_ports {slave_rx[7]}]
set_load -pin_load 0.15 [get_ports {slave_rx[6]}]
set_load -pin_load 0.15 [get_ports {slave_rx[5]}]
set_load -pin_load 0.15 [get_ports {slave_rx[4]}]
set_load -pin_load 0.15 [get_ports {slave_rx[3]}]
set_load -pin_load 0.15 [get_ports {slave_rx[2]}]
set_load -pin_load 0.15 [get_ports {slave_rx[1]}]
set_load -pin_load 0.15 [get_ports {slave_rx[0]}]
set_load -pin_load 0.15 [get_ports slave_data_valid]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports start]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_tx[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_tx[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_tx[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_tx[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_tx[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_tx[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_tx[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_tx[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_tx[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_tx[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_tx[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_tx[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_tx[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_tx[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_tx[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_tx[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_rx[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_rx[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_rx[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_rx[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_rx[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_rx[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_rx[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {master_rx[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports master_done]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports master_busy]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_rx[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_rx[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_rx[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_rx[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_rx[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_rx[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_rx[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {slave_rx[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports slave_data_valid]
set_max_fanout 20.000 [current_design]
set_input_transition 0.12 [get_ports clk]
set_input_transition 0.12 [get_ports rst_n]
set_input_transition 0.12 [get_ports start]
set_input_transition 0.12 [get_ports {master_tx[7]}]
set_input_transition 0.12 [get_ports {master_tx[6]}]
set_input_transition 0.12 [get_ports {master_tx[5]}]
set_input_transition 0.12 [get_ports {master_tx[4]}]
set_input_transition 0.12 [get_ports {master_tx[3]}]
set_input_transition 0.12 [get_ports {master_tx[2]}]
set_input_transition 0.12 [get_ports {master_tx[1]}]
set_input_transition 0.12 [get_ports {master_tx[0]}]
set_input_transition 0.12 [get_ports {slave_tx[7]}]
set_input_transition 0.12 [get_ports {slave_tx[6]}]
set_input_transition 0.12 [get_ports {slave_tx[5]}]
set_input_transition 0.12 [get_ports {slave_tx[4]}]
set_input_transition 0.12 [get_ports {slave_tx[3]}]
set_input_transition 0.12 [get_ports {slave_tx[2]}]
set_input_transition 0.12 [get_ports {slave_tx[1]}]
set_input_transition 0.12 [get_ports {slave_tx[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.05 [get_clocks clk]
set_clock_uncertainty -hold 0.05 [get_clocks clk]
