###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID ecevlsi.nsut.ac.in)
#  Generated on:      Wed Jul  1 12:49:07 2026
#  Design:            spi_top
#  Command:           route_design
###############################################################
current_design spi_top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_input_transition 0.12  [get_ports {clk}]
set_input_transition 0.12  [get_ports {rst_n}]
set_input_transition 0.12  [get_ports {start}]
set_input_transition 0.12  [get_ports {master_tx[7]}]
set_input_transition 0.12  [get_ports {master_tx[6]}]
set_input_transition 0.12  [get_ports {master_tx[5]}]
set_input_transition 0.12  [get_ports {master_tx[4]}]
set_input_transition 0.12  [get_ports {master_tx[3]}]
set_input_transition 0.12  [get_ports {master_tx[2]}]
set_input_transition 0.12  [get_ports {master_tx[1]}]
set_input_transition 0.12  [get_ports {master_tx[0]}]
set_load -pin_load -max  0.15  [get_ports {master_rx[7]}]
set_load -pin_load -min  0.15  [get_ports {master_rx[7]}]
set_load -pin_load -max  0.15  [get_ports {master_rx[6]}]
set_load -pin_load -min  0.15  [get_ports {master_rx[6]}]
set_load -pin_load -max  0.15  [get_ports {master_rx[5]}]
set_load -pin_load -min  0.15  [get_ports {master_rx[5]}]
set_load -pin_load -max  0.15  [get_ports {master_rx[4]}]
set_load -pin_load -min  0.15  [get_ports {master_rx[4]}]
set_load -pin_load -max  0.15  [get_ports {master_rx[3]}]
set_load -pin_load -min  0.15  [get_ports {master_rx[3]}]
set_load -pin_load -max  0.15  [get_ports {master_rx[2]}]
set_load -pin_load -min  0.15  [get_ports {master_rx[2]}]
set_load -pin_load -max  0.15  [get_ports {master_rx[1]}]
set_load -pin_load -min  0.15  [get_ports {master_rx[1]}]
set_load -pin_load -max  0.15  [get_ports {master_rx[0]}]
set_load -pin_load -min  0.15  [get_ports {master_rx[0]}]
set_load -pin_load -max  0.15  [get_ports {master_done}]
set_load -pin_load -min  0.15  [get_ports {master_done}]
set_load -pin_load -max  0.15  [get_ports {master_busy}]
set_load -pin_load -min  0.15  [get_ports {master_busy}]
set_input_transition 0.12  [get_ports {slave_tx[7]}]
set_input_transition 0.12  [get_ports {slave_tx[6]}]
set_input_transition 0.12  [get_ports {slave_tx[5]}]
set_input_transition 0.12  [get_ports {slave_tx[4]}]
set_input_transition 0.12  [get_ports {slave_tx[3]}]
set_input_transition 0.12  [get_ports {slave_tx[2]}]
set_input_transition 0.12  [get_ports {slave_tx[1]}]
set_input_transition 0.12  [get_ports {slave_tx[0]}]
set_load -pin_load -max  0.15  [get_ports {slave_rx[7]}]
set_load -pin_load -min  0.15  [get_ports {slave_rx[7]}]
set_load -pin_load -max  0.15  [get_ports {slave_rx[6]}]
set_load -pin_load -min  0.15  [get_ports {slave_rx[6]}]
set_load -pin_load -max  0.15  [get_ports {slave_rx[5]}]
set_load -pin_load -min  0.15  [get_ports {slave_rx[5]}]
set_load -pin_load -max  0.15  [get_ports {slave_rx[4]}]
set_load -pin_load -min  0.15  [get_ports {slave_rx[4]}]
set_load -pin_load -max  0.15  [get_ports {slave_rx[3]}]
set_load -pin_load -min  0.15  [get_ports {slave_rx[3]}]
set_load -pin_load -max  0.15  [get_ports {slave_rx[2]}]
set_load -pin_load -min  0.15  [get_ports {slave_rx[2]}]
set_load -pin_load -max  0.15  [get_ports {slave_rx[1]}]
set_load -pin_load -min  0.15  [get_ports {slave_rx[1]}]
set_load -pin_load -max  0.15  [get_ports {slave_rx[0]}]
set_load -pin_load -min  0.15  [get_ports {slave_rx[0]}]
set_load -pin_load -max  0.15  [get_ports {slave_data_valid}]
set_load -pin_load -min  0.15  [get_ports {slave_data_valid}]
set_wire_load_mode enclosed
set_max_fanout 20  [get_designs {spi_top}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {start}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_tx[7]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_tx[6]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_tx[5]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_tx[4]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_tx[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_tx[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_tx[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_tx[0]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_tx[7]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_tx[6]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_tx[5]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_tx[4]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_tx[3]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_tx[2]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_tx[1]}]
set_input_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_tx[0]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_rx[7]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_rx[6]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_rx[5]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_rx[4]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_rx[3]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_rx[2]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_rx[1]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_rx[0]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_data_valid}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_busy}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_rx[7]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_rx[6]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_rx[5]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_rx[4]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_rx[3]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_rx[2]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {slave_rx[1]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_rx[0]}]
set_output_delay -add_delay 1 -max -clock [get_clocks {clk}] [get_ports {master_done}]
set_clock_uncertainty 0.05 [get_clocks {clk}]
